Student-DB Extension: Extend the university data frame by adding single lines of code according to the comments below!

In [8]:
#PANDAS Data Frames
import pandas as pd

In [9]:
list_2dim = [[100112,"Jim Collins","WI7",4],[120095,"Martin Schrader","WI3",7],[180331,"Achim Zahn","WI7",1],[180332,"Mark Maier","OM3",1]]

#Start with the provided 2dim-list and create a data frame 
df = pd.DataFrame(list_2dim, index=['ID1', 'ID2', 'ID3', 'ID4'], columns=['ID', 'Name', 'Study field', 'Semester'])
df
#Rename the column which stores the information about field of study
df = df.rename(columns = {'Study field':'Major'})
df
#Rename all indices to ['ID-1', 'ID-2', 'ID-3', 'ID-4']
df.index=['ID-1', 'ID-2', 'ID-3', 'ID-4']
df
#Print only column names to check 
print(str(df.columns))
#Print only index names to check 
print(str(df.index))

df

Index(['ID', 'Name', 'Major', 'Semester'], dtype='object')
Index(['ID-1', 'ID-2', 'ID-3', 'ID-4'], dtype='object')

          ID             Name Major  Semester
ID-1  100112      Jim Collins   WI7         4
ID-2  120095  Martin Schrader   WI3         7
ID-3  180331       Achim Zahn   WI7         1
ID-4  180332       Mark Maier   OM3         1

In [14]:
#Select all rows, but only last two columns without using column or index names
df.iloc[:, -2:]

     Major  Semester
ID-1   WI7         4
ID-2   WI3         7
ID-3   WI7         1
ID-4   OM3         1

In [11]:
#Select first and second attribute from first and second row, without using column or index names
df.iloc[:2, :2]

          ID             Name
ID-1  100112      Jim Collins
ID-2  120095  Martin Schrader

In [15]:
#Combine positional and label-based indexing to select Name and Semesters of the students in the last two rows
df.iloc[-2:, df.columns.get_indexer(['Name', 'Semester'])]

            Name  Semester
ID-3  Achim Zahn         1
ID-4  Mark Maier         1